# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника. Требуется сравнить длину каждого
# отрезка-стороны с суммой двух других. Если хотя бы в одном случае отрезок окажется
# больше суммы двух других, то треугольника с такими сторонами не существует.
# Отдельно сообщить является ли треугольник разносторонним,
# равнобедренным или равносторонним.

flag = True

while flag == True:
    try:
        a = int(input('Введите сторону a: '))
        b = int(input('Введите сторону b: '))
        c = int(input('Введите сторону c: '))

        if a < b + c and b < a + c and c < a + b:
            if a != b != c != a:
                print('Треугольник разносторонний')
            elif (a == b != c) or (a == c != b) or (b == c != a):
                print('Треугольник равнобедренный')
            elif a == b == c:
                print('Треугольник равносторонний')
        else:
            print('Такого треугольника не существует!')
        flag = False

    except ValueError:
        print('Нужно вводить число!')

